[
{"url": "https://news.yahoo.com/live-updates-kharkiv-nuclear-facility-060546360.html", "source": "Yahoo News", "title": "Live updates: Separatist leader floats vote to join Russia", "description": "A separatist leader in eastern Ukraine says that his region wants to hold a vote on joining Russia.  Leonid Pasechnik, the head of the self-proclaimed...", "date": "2022-03-27T06:05:46.000Z", "author": "The Associated Press", "text": ["A separatist leader in eastern Ukraine says that his region wants to hold a vote on joining Russia.", "Leonid Pasechnik, the head of the self-proclaimed Luhansk People’s Republic, said Sunday that it could hold a referendum “in the nearest time” asking voters whether they support making the region part of Russia.", "Russia has supported the separatist rebels in Luhansk and the neighboring Donetsk regions since an insurgency erupted there in 2014 shortly after Moscow’s annexation of the Crimean Peninsula. Moscow recognized their independence on Feb. 21 and then cited their call for military assistance to launch the invasion of Ukraine on Feb. 24.", "In talks with Ukraine, Moscow has urged it to acknowledge Russia’s sovereignty over Crimea and the independence of the Donetsk and Luhansk regions. Pasechnik’s statement could herald a shift in the Russian position.", "___", "KEY DEVELOPMENTS IN THE RUSSIA-UKRAINE WAR:", "— Zelenskyy: West ", " in helping Ukraine fight", "— ‘My personal tragedy’: Ukrainians ", " on Odesa", "— Ukrainians have been ", " but an Afghan student was not", "— War ", " to energy independence, climate goals", "Go to ", " for more coverage", "___", "OTHER DEVELOPMENTS:", "BERLIN -- Germany’s president is hosting a “solidarity concert” with Ukraine featuring musicians from Ukraine, Russia and Belarus.", "The Berlin Philharmonic was playing pieces by Ukrainian, Russian and Polish composers at President Frank-Walter Steinmeier’s Bellevue palace in Berlin. Steinmeier — who addressed the event by video because he tested positive for the coronavirus last week — described it Sunday as a “signal for freedom and peace.”", "Steinmeier said: “Let us be vigilant against sweeping animosities, and let us not succumb to (Russian President Vladimir) Putin’s pseudo-historical nationalist delusion. Let us not allow Putin’s hatred to become a hatred between people … in our own society either.”", "However, Ukraine’s ambassador to Germany tweeted that he had spurned an invitation. Andriy Melnyk wrote that “ONLY RUSSIAN (!) SOLOISTS” were performing, “no Ukrainians.” He added: “An affront. Sorry, I’m staying away.”", "___", "JERUSALEM — Secretary of State Antony Blinken says the U.S. is not trying to topple Russian President Vladimir Putin, despite its harsh condemnations of Russia’s invasion of Ukraine.", "Blinken spoke a day after President Joe Biden said of Putin during a speech in Warsaw: “For God’s sake, this man cannot remain in power.”", "At a news conference in Jerusalem, Blinken said Biden’s point was that “Putin cannot be empowered to wage war or engage in aggression against Ukraine or anyone else.”", "He said the U.S. has repeatedly said that “we do not have a strategy of regime change in Russia, or anywhere else for that matter.”", "“In this case, as in any case, it’s up to the people of the country in question. It’s up to the Russian people,” Blinken said.", "___", "BERLIN -- Germany’s president is hosting a “solidarity concert” with Ukraine featuring musicians from Ukraine, Russia and Belarus.", "The Berlin Philharmonic was playing pieces by Ukrainian, Russian and Polish composers at President Frank-Walter Steinmeier’s Bellevue palace in Berlin. Steinmeier described it Sunday as a “signal for freedom and peace.”", "Steinmeier said: “Let us be vigilant against sweeping animosities, and let us not succumb to (Russian President Vladimir) Putin’s pseudo-historical nationalist delusion. Let us not allow Putin’s hatred to become a hatred between people … in our own society either.”", "However, Ukraine’s ambassador to Germany tweeted that he had spurned an invitation. Andriy Melnyk wrote that “ONLY RUSSIAN (!) SOLOISTS” were performing, “no Ukrainians.” He added: “An affront. Sorry, I’m staying away.”", "___", "KYIV, Ukraine —- Ukrainian President Volodymyr Zelenskyy has again urged the West to provide Ukraine with warplanes and air defense missiles.", "Speaking in a video address early Sunday, Zelenskyy said that “our partners have all that, and it’s just collecting dust. And in fact it’s necessary not just for Ukraine’s freedom, but for the freedom of Europe.”", "Zelenskyy warned that the Baltic states, Poland and Slovakia could eventually face a Russian attack “just because they will have kept in their hangars just 1% of all NATO warplanes and 1% of all NATO tanks. Just 1%! We aren’t asking for more and we have been waiting for that for 31 days!”", "He said that “our partners must step up their aid to Ukraine.”", "The president said that “Ukraine can’t shoot down Russian missiles with shotguns and machine guns that have accounted for the bulk of supplies. And we can’t unblock Mariupol without the necessary number of tanks, other armor, and warplanes. All defenders of Ukraine know about it.”", "He added that the United States and “all European politicians” also know that.", "___", "DOHA, Qatar — The head of the International Monetary Fund is warning that the global economic strain caused by Russia’s war in Ukraine could stoke civil unrest in the Middle East and beyond.", "Speaking at the Doha Forum in Qatar on Sunday, Kristalina Georgieva said Russia’s invasion and the resulting sanctions on Moscow have forced the world’s poorest to bear the worst of the crisis as they grapple with inflated food costs and scarcer jobs.", "Georgieva hinted that the current situation evoked the lead-up to the 2011 uprisings known as the Arab Spring, when skyrocketing bread prices fueled anti-government protests across the Middle East.", "“When prices jump, and poor people cannot feed their families, they will be on the streets,” she said. “One thing we know about trouble in one place, it travels, it doesn’t stay there.”", "Georgieva called for greater global cooperation to fill the gaps in commodity and energy supplies.", "“Please, work together,” she said. “Oil producers, gas producers and food producers today are in a position to help reduce this uncertainty.”", "She cited Ukraine’s importance as a top wheat exporter in urging a swift resolution to the war.", "“The faster the tanks are out, the faster the tractors will be in,” she said. “We need by July the harvest in Ukraine to contribute to the stability of food prices.”", "___", "NEW YORK — The Russian military says it has struck Ukrainian military facilities with long-range missiles.", "Russian Defense Ministry spokesman Maj. Gen. Igor Konashenkov said in statement on Sunday that the air-launched cruise missiles hit a fuel depot and a defense plant in Lviv near the border with Poland a day earlier.", "Konashenkov said another strike with sea-launched missiles destroyed a depot with air defense missiles in Plesetske, just west of the Ukrainian capital of Kyiv.", "___", "ODESA, Ukraine — The Black Sea port of Odesa is mining its beaches and rushing to defend its cultural heritage from a feared Mariupol-style fate in the face of growing alarm that the strategic city might be next as Russia attempts to strip Ukraine of its coastline.", "The multi-cultural jewel, dear to Ukrainian hearts and even Russian ones, would be a hugely strategic win for Russia. It is the country’s largest port, crucial to grain and other exports, and headquarters for the Ukrainian navy.", "Bombardment from the sea last weekend further raised worries that the city is in Russia’s sights.", "Residents say Russian President Vladimir Putin would be insane to take Odesa with the brutal approach that has left other Ukrainian cities in ruins. Once a gilded powerhouse of the Russian empire, Odesa includes one of the finest opera houses in Europe and the famed Potemkin Steps between the city and the sea, featured in Soviet filmmaker Sergei Eisenstein’s 1925 silent film masterpiece “Battleship Potemkin.”", "___", "LONDON — The Russian military appears to be trying to encircle Ukrainian forces fighting in the separatist regions in the eastern part of the country, Britain’s Ministry of Defense says.", "Russian forces are advancing southward from the area around Kharkiv and north from Mariupol, the ministry said in an intelligence briefing released Sunday morning.", "Battlefields in northern Ukraine remain “largely static,” with Ukrainian counterattacks hampering Russian efforts to reorganize their forces, the ministry said.", "In an earlier briefing released overnight, the ministry said Russia continued to strike targets across Ukraine, including many in densely populated areas, the ministry said.", "Russia is relying on “stand-off” missiles launched from within its own territory to reduce aircraft exposure to Ukrainian anti-aircraft fire, the ministry said. But it said limited stocks of these weapons will force Russia to “revert to less sophisticated missiles or accepting more risk to their aircraft.”", "___", "LVIV, Ukraine — Ukrainian President Volodymyr Zelenskyy angrily warned Moscow that it is sowing a deep hatred for Russia among his people, as constant artillery barrages and aerial bombings are reducing cities to rubble, killing civilians and driving others into shelters, leaving them to scrounge for food and water to survive.", "“You are doing everything so that our people themselves leave the Russian language, because the Russian language will now be associated only with you, with your explosions and murders, your crimes,” Zelenskyy said in an impassioned video address late Saturday.", "___", "KYIV, Ukraine — Ukraine’s nuclear watchdog says that a nuclear research facility in Kharkiv again has come under shelling by Russia and the fighting makes it impossible to assess the damage.", "The State Nuclear Regulatory Inspectorate said that the neutron source experimental facility in the Kharkiv Institute of Physics and Technology came under fire Saturday.", "Ukrainian authorities have previously reported that Russian shelling damaged buildings at the Kharkiv facility, but there has been no release of radiation. The newly built neutron source facility is intended for the research and production of radioisotopes for medical and industrial needs. The International Atomic Energy Agency has said that the nuclear material in the facility is always subcritical and the inventory of radioactive material is very low, reducing the risks of radiation release.", "Kharkiv has been besieged by Russian forces since the start of the invasion and has come under repeated shelling of its residential buildings and critical infrastructure.", "Ukraine’s nuclear facilities have been threatened by the Russian invasion.", "___", "LVIV, Ukraine — The governor of the Lviv region says a man was detained on suspicion of espionage at the site of one of the two rocket attacks that rattled the city on Saturday.", "Maksym Kozytskyy said police found the man had recorded a rocket flying toward the target and striking it. Police also found on his telephone photos of checkpoints in the region, which Kozytskyy said had been sent to two Russian telephone numbers.", "Rockets hit an oil storage facility and an unspecified industrial facility, wounding at least five people. A thick plume of smoke and towering flames could be seen on Lviv’s outskirts hours after the attacks."]},
{"url": "https://news.yahoo.com/russia-signals-scaled-back-war-202952037.html", "source": "Yahoo News", "title": "Russia signals scaled-back war aims as Ukraine advances", "description": "STORY: Ukrainian forces went on the offense against Russian soldiers on Friday, recapturing towns on the outskirts of the embattled capital, Kyiv.And one...", "date": "2022-03-25T20:29:52.000Z", "author": "Reuters Videos", "text": ["STORY: Ukrainian forces went on the offense against Russian soldiers on Friday, recapturing towns on the outskirts of the embattled capital, Kyiv.", "And one month after Russia sent a massive invasion force into Ukraine, expecting a rapid victory, Moscow signaled it was scaling back its military ambitions.", "The Russian defense ministry announced the first phase of what Russia calls its “special military operation” was complete and that it would focus on completely, quote, “liberating” eastern Ukraine’s Donbass region.", "Its forces remained bogged down, harried and ambushed by Ukrainian defenders, and so far unable to claim a single major strategic objective… and now, in some places, may be forced into a retreat.", "A British intelligence report described, quote, \"Ukrainian counter-attacks, and Russian forces falling back on overextended supply lines, has allowed Ukraine to reoccupy towns and defensive positions up to 35 km east of Kyiv.\"", "One Ukrainian soldier on the frontline in Bucha, about 16 miles from the capital, who gave only the name Andriy, said he enlisted immediately after Russia’s invasion began a month ago.", "\"I told my wife to grab the children and to hide in the basement, and I went to the drafting station and joined my (army) unit straight away. And the next day from the army base we moved to the frontline. My wife and children were under occupation for two weeks, but then they managed to escape through a humanitarian corridor.\"", "Ukraine's armed forces chief of staff said Russia was still trying to resume offensives to capture the cities of Chernihiv, Sumy, Mariupol and Kharkiv.", "Battlelines near Kyiv have been frozen for weeks.", "Failing to capture any major cities, the Russians have instead been encircling them, laying waste to residential areas and driving around a quarter of Ukraine’s 44 million people from their homes.", "Natalia Stern, a refugee from the southern port city of Odesa who is currently in Romania, had this to say Friday:", "\"Support. We need support. We believe in ourselves - and believe strongly. Please, support us and our children. A huge thanks for you all in advance.\""]},
{"url": "https://news.yahoo.com/is-now-the-right-time-to-bring-workers-back-to-the-office-213538157.html", "source": "Yahoo News", "title": "Is now the right time to bring workers back to the office?", "description": "The president and some big-name CEOs are eager to end the remote work era, but most workers don't share their enthusiasm.", "date": "2022-03-11T21:35:38.000Z", "author": "Mike Bebernes", "text": ["Roughly two years after the coronavirus pandemic forced white-collar workers around the country to adjust to working from home, some lawmakers and businesses are eager to finally bring them back to the office.", "“It’s time for America to get back to work and fill our great downtowns again with people,” President Biden ", " earlier this month while citing the significant decline in daily COVID cases over the past several weeks. New York City Mayor Eric Adams ", " a few days later, saying, “You can't stay home in your pajamas all day.”", "Some of the country’s biggest companies have recently unveiled plans that will require employees to work from the office at least some of the time. ", ", Google’s parent company, will mandate in-person work three days a week starting next month. The federal government has also ", " to transition most of its workforce from remote work.", "This enthusiasm for a return to the office is not shared by the majority of workers. A number of ", " show that ", " some or all of the time, and as many as 30 percent say they would be ", " if their employer required them to come into the office every day.", "As much attention as the debate over returning to the office gets, it only affects a small minority of workers. Last month, only about 13% of the U.S. workforce", ", according to the Department of Labor. Everyone else either worked in person — as many have done throughout the pandemic — or worked remotely for other reasons.", "Optimism about the course of the pandemic has made the push to return to the office possible. But even beyond the enduring debate over whether it’s safe to gather workers in the same building, there is real disagreement over whether it makes sense to ask — and in some cases, force — white-collar workers to give up the work-from-home arrangements they’ve known for the past two years.", "Advocates argue that in-person work has enormous benefits for companies and individual employees, both in terms of productivity and mental health, that may have been forgotten after so much time away from the office. Some also make the case that many workers who are against returning are wary of what office life used to be, even though most employers have taken major strides to incorporate some of the benefits of the work-from-home era — like flexible schedules, hybrid work and greater respect for employees’ personal needs — into their new in-office setup. Others say bringing workers back into urban financial centers will have major economic benefits for small businesses in those areas and be a significant step toward establishing a post-pandemic normal that the country desperately needs.", "Opponents say too many executives are prioritizing abstract concepts like camaraderie and normalcy over measurable burdens that being forced to come to the office imposes on workers, including lost time, the cost of commuting, disruption to child care and increased risk from COVID. Some economists also argue that companies have a strong interest in letting their employees decide which work setup suits them best. The tight labor market, they say, means that executives who overplay their hands could see a large share of their staff leave for new jobs where employers are more willing to accommodate them.", "“On the one hand, the pandemic has taught many of us that there are a lot of jobs that simply don't require being in an office. At the same time, there are real benefits to having everyone together–even if not all the time. For example, teams develop relationships differently when they're together in person, compared to only connecting online. There are plenty of situations where that difference matters enough to a company that they want to get people together.” — Jason Aten, ", "“The in-person meetings may not matter, but the chitchat, lunches and happy hours do. Even the commute that we griped about had the value of keeping us in touch with our cities. We need to figure out how to maintain these structures before we throw out all our pre-pandemic work habits and hunker down in our home offices.” — Paula Marantz Cohen, ", "“Activity in central business districts will pick up–dining, takeout, services and retail sales to workers there, janitorial and guard services, etcetera. By how much, we don't know.” — Erica Groshen, economist, to ", "“What we don’t talk about as much is the fallout from so much WFH. Beyond isolation and burnout, collaboration suffers, and younger workers and new hires aren’t able to get the same level of mentoring and training they’d gain from an in-person experience. Those of us who have to take care of young children or older relatives while working from home are also carrying a heavier mental load, even as children and relatives may have benefited from our unexpected presence.” — Shirley Leung, ", "“If we give workers a beneficial reason to come to the office, aside from escaping kids and spouses at home, they will come. This includes onboarding new hires, learning corporate culture, mentoring, collaboration meetings and brainstorming. No longer will everyone want to commute simply to isolate and have managers presumptuously assume that hours in the office equals productivity and effort.” — Norm Miller, economist, to ", "“The future of the workplace is a debate worth having, but not in the middle of a gas crisis. Just think, the next time you’re sitting [in] your daily Zoom meeting, reminding your boss to unmute, with your car parked in the driveway, you’ll also be sending a message to Vladimir Putin: Take your gas and shove it!” — Will Bunch, ", "“While there are undoubtedly economic knock-on effects, the mass COVID experiment in working from home wasn’t the drag on productivity that pajama critics like New York’s mayor seem to envision. This is something we know how to do and have generally done quite well.” — Brooke Sutherland, ", "“Biden’s eat-your-peas-and-get-back-to-the-office appeal was part of his campaign to highlight his administration’s COVID successes. And there’s certainly a logic to showing off that success through the spectacle of crowded downtowns, full restaurants, and a return to the rhythms of pre-pandemic life. But many Americans find restoring those rhythms distasteful, after getting hours of their life back daily through working from home.” — David Dayen, ", "“The past two years were not an aberration to overcome but an accelerator of positive change that moved companies toward a flexible future, leaving behind cubicle farms and corner offices to gather dust in a museum right next to the fax machine.” — Keith Ferrazzi and Kian Gohar, ", "“With a shrinking workforce and an increasing war for talent, employers who don’t provide flexibility will be the losers.” — Libby Sander, ", "“A two-tier system is emerging in which highly paid professionals have more options than ever, while middle-income workers often are ordered back to full-time on-site work and might have little choice but to quit. … And the pattern already is having disastrous economic consequences for these workers and their families.” — Joan C. Williams, ", "Photo illustration: Yahoo News; photos: Getty Images"]},
{"url": "https://news.yahoo.com/democrat-abby-broyles-drops-oklahoma-152743889.html", "source": "Yahoo News", "title": "Democrat Abby Broyles drops out of Oklahoma congressional race", "description": "Democrat Abby Broyles, who drew national attention after admitting she blacked out at a sleepover for middle-school girls and vomited in a clothes hamper...", "date": "2022-03-25T15:27:43.000Z", "author": "Yahoo News Video", "text": ["Democrat Abby Broyles, who drew national attention after admitting she blacked out at a sleepover for middle-school girls and vomited in a clothes hamper, announced Thursday she's dropping out of the race for Oklahoma's Fifth Congressional District.", "[MUSIC PLAYING]"]},
{"url": "https://news.yahoo.com/u-sees-russia-focusing-eastern-184528111.html", "source": "Yahoo News", "title": "U.S. sees Russia focusing on eastern Ukraine, senior U.S. defense official says", "description": "WASHINGTON (Reuters) -The United States assesses that Russia is prioritizing eastern Ukraine's Donbass, as opposed to Kyiv, in what could be an effort to...", "date": "2022-03-25T18:45:28.000Z", "author": "Idrees Ali and Phil Stewart", "text": ["By Idrees Ali and Phil Stewart", "WASHINGTON (Reuters) -The United States assesses that Russia is prioritizing eastern Ukraine's Donbass, as opposed to Kyiv, in what could be an effort to build leverage in negotiations and cut off Ukrainian forces in the east from the rest of the country, a senior U.S. defense official said on Friday.", "Russia said earlier on Friday that the first phase of its military operation was mostly complete and it would focus on completely \"liberating\" Ukraine's breakaway eastern Donbass region.", "The announcement appeared to indicate Moscow may be switching to more limited objectives after running into fierce Ukrainian resistance in a month of war.", "The senior U.S. official suggested Russia's activities on the ground appeared broadly to back up Moscow's announcement.", "\"They are prioritizing it and we concur, our information would concur, with that,\" the official, speaking on condition of anonymity, told reporters.", "The official said the United States was seeing Russian forces become more aggressive in the Donbass area.", "\"They have certainly made it a higher priority on their list,\" the official added.", "The city of Kherson, a regional capital of about 250,000 people, did not seem to be as solidly in Russian control as it was before and appeared to be contested, the official said.", "Kherson was the first big urban center to fall into the hands of Russian troops after they invaded Ukraine on Feb. 24.", "Russian troops have largely stalled around Kyiv and are establishing defensive positions, the official said.", "On Friday, Sergei Rudskoi, head of the Russian General Staff's Main Operational Directorate, said 1,351 Russian soldiers had died in the operation and 3,825 been injured. Ukraine's military has said some 15,000 Russian soldiers have been killed in combat.", "Russia's combat power in Ukraine was somewhere between 85 and less than 90% of its pre-invasion levels, the U.S. defense official said.", "For the first time, the official said, the United States had signs that Russia was looking to draw on its troops in Georgia to help in Ukraine.", "It was unclear what their timeline was and where exactly they would go, but the official said it would not be surprising if they were sent into the Donbass region.", "Ukrainian authorities have said Russian forces had effectively surrounded the northern city of Chernihiv and were bombarding areas where residents were stuck without electricity, heating and water.", "The U.S. official said Ukrainian forces were making incremental progress against Russian troops around Chernihiv.", "On Thursday, Ukraine said it had destroyed a large Russian landing support ship at the Russian-occupied port of Berdiansk on the Sea of Azov.", "The U.S. official confirmed Ukrainian forces had destroyed the Russian warship in Berdiansk, but it was unclear how many casualties there had been.", "(Reporting by Idrees Ali and Phil Stewart; Editing by Chizu Nomiyama and Daniel Wallis)"]},
{"url": "https://news.yahoo.com/trump-rails-against-ketanji-brown-041405823.html", "source": "Yahoo News", "title": "Trump rails against Ketanji Brown Jackson after her Supreme Court confirmation hearings", "description": "Former president says she had ‘had total disdain and even hatred’ for Republican senators", "date": "2022-03-27T04:14:05.000Z", "author": "Eric Garcia", "text": ["Former president ", " railed against Judge ", ", specifically criticising how she responded to Republican senators’ questions earlier this week during her ", " confirmation hearing.", "Mr Trump spoke at a rally in Commerce, Georgia, where he railed against Republican incumbent Gov ", ", but took time to criticise Ms Jackson, a judge who has frequently ruled against him before her nomination to the Supreme Court.", "“Judge Jackson was unbelievably disrespectful to Republican Senators that in many cases were really nicely asking questions,” he said. “She had total disdain and even hatred for them.”", "Republicans senators — including Sen Josh Hawley of Missouri and Ted Cruz of Texas, who also led the charge to object to the 2020 presidential election results — repeatedly asked Ms Jackson about her sentencing for people convicted of possessing child sex abuse images, which they believed was too lenient.", "In addition, Mr Cruz asked her about critical race theory and whether it factored into he rulings as well as whether she knew it was being taught at Georgetown Day School, where she is on the board.", "Mr Trump also said Ms Jackson was proud of the fact that she ruled against him.", "“And I understand the fact that she’s very proud of the fact that she never once voted to support President Trump on anything, she always voted against me and she brags about it,” he said with the audience booing when he said she said “’I always voted against Trump.’ How about that? Is that nice?”", "In 2019, Ms Jackson, then a judge for the United States District Court for the District of Columbia, ", "claims that former White House Counsel Don McGahn could not assert absolute immunity from a subpoena to testify before the House Judiciary Committee, writing that “Presidents are not kings.”", "During her confirmation, she was asked about the ruling.", "“The framers decided, after experiencing monarchy, tyranny, and the like that they were going to create a government that would split the powers of a monarch in several different ways,” she said. “One was federalism. It was vertical, they would split the powers between the federal government and states. Another was to prevent the federal government from itself becoming too powerful from having all of the authorities from having legislative, executive and judicial authority concentrated in one place.”", "In that same position, she also ruled against the Trump administration’s ", " deportations.", "The Senate Judiciary Committee will vote whether to confirm Ms Jackson on April 4."]},
{"url": "https://news.yahoo.com/trump-apos-earth-apos-judge-023117660.html", "source": "Yahoo News", "title": "Trump: 'How on earth' can Judge Jackson say what the Constitution is if she can't say what a woman is", "description": "Former President Donald Trump blasted Biden Supreme Court nominee Ketanji Brown Jackson over her inability to provide the definition of a woman during her...", "date": "2022-03-27T02:31:17.000Z", "author": "Andrew Miller", "text": ["Former President ", " blasted ", " ", " nominee Ketanji Brown Jackson over her inability to provide the definition of a woman during her confirmation hearing this week.", "\"The left has become so extreme that we now have a justice being nominated to the Supreme Court who testified under oath that she could not say what a woman is,\" Trump told the crowd at a Save America rally in Commerce, Georgia on Saturday night. \"If she can't even say what a woman is. How on earth can she be trusted to say what the Constitution is?\"", "Jackson was ", " after ", " during her Senate Judiciary confirmation hearings Tuesday night.", "Sen. Marsha Blackburn, R-Tenn., brought up transgender issues in her questioning and asked Jackson, \"Can you provide a definition for the word ‘woman?’\"", "\"Can I provide a definition? No, I can’t,\" the judge responded before further explaining, \"Not in this context, I'm not a biologist.\"", "\"Do you believe the meaning of the word woman is so unclear and controversial that you can't give me a definition?\" Blackburn pressed.", "\"Senator, in my work as a judge, what I do is I address disputes. If there's a dispute about a definition, people make arguments, and I look at the law, and I decide,\" Jackson responded.", "In his speech on Saturday night, Trump added \"a party that's unwilling to admit that men and women are biologically different in defiance of all scientific and human history is a party that should not be anywhere near the levers of power in the United States.\""]},
{"url": "https://news.yahoo.com/thousands-russians-prague-protest-against-163027660.html", "source": "Yahoo News", "title": "Thousands of Russians in Prague protest against war in Ukraine", "description": "Thousands of Russians marched through Prague on Saturday, waving the white-blue-white flag that has become a symbol of protests against Moscow's invasion of ...", "date": "2022-03-26T16:30:27.000Z", "author": "Jason Hovet", "text": ["By Jason Hovet", "PRAGUE (Reuters) - Thousands of Russians marched through Prague on Saturday, waving the white-blue-white flag that has become a symbol of protests against Moscow's invasion of Ukraine.", "Carrying signs that read \"Killer\" over a picture of President Vladimir Putin and chanting \"No to War\", protesters walked from Prague's Peace Square through the centre of the Czech capital. Police put the number of marchers at about 3,000.", "\"We are against Putin,\" said Alexander Sibrimov, a 19-year-old student who attended the protest with his father.", "\"We don't agree with his politics. This is a way to show the world that the things happening in Ukraine are not right.\"", "Moscow calls its actions in Ukraine a \"special military operation\" to demilitarise and \"denazify\" its neighbour, and denies targeting civilians. Ukraine and its Western allies have called that a baseless pretext for an unprovoked invasion.", "The Czech Republic is home to 45,000 Russians, the fourth largest foreign community in the former communist-ruled country.", "Nearly 200,000 Ukrainians lived in the Czech Republic - making them the biggest foreign community - before Russia's invasion of Ukraine on Feb. 24.", "The Czech government estimates 300,000 Ukrainians have fled to the country.", "\"This is an act to show the Czech Republic and the Czech people that Russians (are) against Putin,\" protest organiser Anton Litvin said.", "The protesters in Prague said they believed they were reflecting what many people in Russia feel but are unable to say.", "\"Just because we are Russians doesn't mean we are automatically for the war. We are against the war,\" said protester Oleg Golopyatov, a former soldier who has lived in Prague for 15 years. \"Ukraine is a normal country. It is terrible (what is happening there).\"", "(Reporting by Jason Hovet, Writing by Michael Kahn, Editing by Timothy Heritage)"]},
{"url": "https://news.yahoo.com/rep-marjorie-taylor-greene-said-092901629.html", "source": "Yahoo News", "title": "Rep. Marjorie Taylor Greene said Pete Buttigieg and his husband should 'stay out of girls' bathrooms'", "description": "Rep. Marjorie Taylor Greene told a Trump rally in Commerce, Georgia, that Transport Sec. Buttigieg and his husband \"should stay out of girls' bathrooms.\"", "date": "2022-03-27T09:29:01.000Z", "author": "Alia Shoaib", "text": ["Rep. Marjorie Taylor Greene said Transport Secretary Pete Buttigieg and his husband should stay out of girls' bathrooms while speaking at Donald Trump's rally in Commerce, Georgia, on Saturday.", "\"You know what? Pete Buttigieg can take his electric vehicles and his bicycles, and he and his husband can stay out of our girl's bathrooms,\" Greene said at the rally.", "Greene seemed to be referencing ongoing debates about what bathrooms transgender people should use– but Pete Buttigieg and his husband Chasten are gay, not transgender.", "Some Twitter users suggested that Greene's comments about Buttigieg were homophobic.", "The Georgia Republican has been a vocal critic of transgender people ", " that correspond with their gender identity.", "In her speech, Greene criticized and misgender transgender swimmer Lia Thomas, who has become the center of fierce debates about transgender athletes.", "\"And old Lia Thomas? Lia is going to have to remember his name is William, and he needs to go back to men's swimming because we're going to kick the biological men out of women's sports,\" Greene said.", "In her comments about Buttigieg, Greene referenced the Transport Secretary's advocacy of electric vehicles as a more environmentally friendly alternative to regular cars.", "Some Republicans, such as Rep. Markwayne Mullin, have accused Buttigieg of being ", " for promoting electric vehicles rather than focusing on soaring gas prices.", "Before her comments about Buttigieg, Greene complained about \"ridiculous high gas prices\" and vowed: \"We're going to drill oil right here in the USA.\"", "In her speech, Greene asked for support ahead of the 2022 midterms. At least seven candidates are planning to ", "The controversial congresswoman has garnered criticism for promoting the ", "and for recently appearing at a conference linked to ", "Read the original article on "]},
{"url": "https://news.yahoo.com/marjorie-taylor-greene-goes-off-004748162.html", "source": "Yahoo News", "title": "Marjorie Taylor Greene Goes Off In Homophobic Rant Against Pete Buttigieg", "description": "The far-right member of Congress seemed to blend together her hateful conspiracy theories.", "date": "2022-03-27T00:47:48.000Z", "author": "Mary Papenfuss", "text": ["Rep. ", " (R-Ga.) went on a twisted rant at ", "’s rally in ", " Saturday telling Transportation Secretary Pete Buttigieg and his husband, Chasten, to “stay out of our girls bathrooms.”", "“You know what?” Greene asked the crowd in Commerce, starting off her bigoted rant. ”Pete Buttigieg can take his electric vehicles and his bicycle, and he and his husband can stay out of our girls bathrooms. Yup.”", "While Greene’s rant was clearly motivated by hate, it is unclear which bigoted conspiracy theory she was drawing on in her attack of the Transportation Secretary and his husband, who are gay.", "Greene has been a vocal opponent of transgender people using the bathroom according to their gender identity. Pete Buttigieg is not transgender, though that didn’t seem to stop Greene from lumping him into her general anti-LGBTQ comments.", "Greene also attacked collegiate swimmer Lia Thomas, who is a trans woman, misgendering her while she yelled.", "In addition, Greene took the opportunity to bash Georgia Democratic gubernatorial candidate ", " as “the Death Star” from the “Star Wars” franchise. But she bungled her sci fi references. Abrams ", " of “Star ", ": Discovery.”", "Greene also warned that she’s “", " Georgia voters who have ", " because of her role in last year’s insurrection, which they argue disqualifies her. Section 3 of the", ", passed after the Civil War, states that no person may hold political office who has “engaged in insurrection or rebellion” or “given aid or comfort” to the nation’s enemies.", "Following her speech, Rolling Stone slapped down Greene, who was recently a key speaker at a ", ", as a “", ".”"]},
{"url": "https://news.yahoo.com/oklahoma-democrat-drops-congressional-bid-143641885.html", "source": "Yahoo News", "title": "Oklahoma Democrat drops congressional bid after sleepover controversy", "description": "Democratic Oklahoma House candidate Abby Broyles announced on Thursday she would be dropping her congressional bid following an incident last month at a...", "date": "2022-03-25T14:36:41.000Z", "author": "The Hill", "text": ["She said that she had told a friend earlier this month that she \"took whatever I had. I just wanted it all to end\" and said that close to two weeks after the scandal broke, she had taken sleeping pills and \"drank heavily\" one morning in an effort to end her life.", "\"The public barrage was the result of a night I honestly can't remember that took place while I assisted in chaperoning a preteen sleepover with a close friend (now former) from law school.\""]},
{"url": "https://news.yahoo.com/marjorie-taylor-greene-professional-bigot-233652353.html", "source": "Yahoo News", "title": "Marjorie Taylor Greene, a Professional Bigot, Tells Pete Buttigieg Stay Out of Girls’ Bathrooms", "description": "The contender for most-bigoted member on Congress used her time at a Trump rally to get weird about the Transportation Secretary and personally attack a...", "date": "2022-03-26T23:36:52.000Z", "author": "William Vaillancourt", "text": ["Rep. ", " (R-Geo.) on Saturday for some reason demanded that Department of Transportation Secretary ", " and his husband, Chasten, “stay out of our girls’ bathrooms.”", "During a brief speech at a rally headlined by ex-President Donald Trump, Greene touched on the typical points of emphasis for a MAGA-devotee such as herself, namely the Jan. 6 insurrection and Hunter Biden’s laptop. The freshman congresswoman — also a full-time online troll who has appeared on the ", " — also told her home-state audience that she intends of defeating ", " aiming to get her removed from the ballot over her election-denying comments prior to the 2020 insurrection.", "After the 2022 midterms, she continued, “You’re going to see a new Republican Party — a Republican Party that defends our nation’s borders, a Republican Party that finishes the wall, a Republican Party that saves this economy and stops this inflation [and] ridiculously high gas prices.” Greene then promised, “We’re going to drill oil right here in the U.S.A.”", "From there, the ", " criticized Buttigieg, ", " the use of public transportation and electric vehicles that were funded through President Biden’s bipartisan infrastructure law passed last year.", "“And you know what?” Greene said, “Pete Buttigieg can take his electric vehicles and his bicycles and he and his husband can stay out of our girls’ bathrooms.”", "It’s impossible to know what exactly Greene means by this. It could be a dog whistle for devotees of any number of bigoted slurs, conspiracies, and stereotypes, but the details don’t really matter. Making ugly, dumb statements is her profession, and rewarding ugly, dumb statements is the modern GOP’s modus operandi, and so she’ll keep doing it.", "Indeed, Greene then pivoted to University of Pennsylvania athlete Lia Thomas, a transgender woman who this month became an NCAA swimming champion.", "“Yeah, and Lia Thomas? Lia’s going to remember his name is William, and he needs to go back to men’s swimming, because we’re going to kick the biological men out of the women’s sports,” Greene said."]},
{"url": "https://news.yahoo.com/oklahoma-congressional-candidate-ends-run-172745676.html", "source": "Yahoo News", "title": "Oklahoma congressional candidate ends run after ‘berating young girls’ in rant", "description": "Abby Broyles, 32, announced that she’d checked into rehab and was terminating her campaign for Oklahoma’s Fifth Congressional District", "date": "2022-03-25T17:27:45.000Z", "author": "Johanna Chisholm", "text": ["The congressional candidate in ", " who was accused of ", " at a middle school sleepover last month has announced that she would be ending her campaign.", "Abby Broyles, a former investigative television journalist, wrote in an essay self-published on the site Medium on Thursday that she had checked herself into ", " a couple of weeks ago and instead of continuing her bid to become the ", " candidate for Oklahoma’s Fifth Congressional District, she would be refocusing on “myself and my happiness”.", "“â\u0080\u008bâ\u0080\u008bNow’s the time to take on my own fight that I’ve been running from for 20 years: facing my mental health challenges head on,” Ms Broyles wrote, after detailing how she’s struggled with ", " for the better part of the past two decades, including severe anxiety, insomnia and an eating disorder.", "The 32-year-old Democrat became embroiled in a media frenzy last month when multiple parents complained about her profanity-laced behaviour directed at a group of middle school aged girls attending a Valentine’s Day sleepover at one of her friends.", "In the essay, Ms Broyles explains how she “hit rock bottom” after the sleepover incident led to her becoming “national clickbait”.", "There was an episode, she describes, where she was admitted to an emergency room after she “drank heavily” in a hotel room and then proceeded to swallow sleeping pills, a reaction she says was in direct response to the “anguishing in pain reading about myself on social media and in tabloid articles”.", "Initially, the former attorney denied the claims raised by the parents, alleging that NonDoc, the outlet that ", ", had gotten it wrong and she hadn’t even attended the party in question. She later recanted that denial and, just days later, apologised on air during an interview with KFOR, the local news channel she used to work at as a journalist.", "“I want to say sorry from the bottom of my heart, I apologise for any hurt or damage or trauma that my behaviour, when I didn’t know what I was doing, caused,” Ms Broyles said during the interview with KFOR. “I’m deeply sorry.”", "A combination of wine and a sleeping pill, she had said, was to blame for her incendiary remarks made to the teen girls during a night in which, she says in the Medium post, she still “honestly can’t remember” what took place.", "“The alleged hurtful comments this woman claims I made under duress do not represent who I am, and to this day, I still have no recollection of what actually occurred that evening and have not spoken to my now former friend,” Ms Broyles writes in the essay.", "The woman who Ms Broyles references in her essay, Sarah Matthews, whose daughter attended the party, described the former Democratic candidate’s alleged actions in a Twitter thread.", "“Since it’s been five days and you have neglected to reach out to any of the young ladies (12 & 13 yr olds, including my daughter) you verbally and emotionally abused last weekend, I thought I would give you a chance to try to apologize (at a minimum) here,” Ms Matthews wrote last month, while tagging Ms Broyles.", "“For someone who pontificates to be undyingly pro woman, I am disgusted by your behavior and find it appalling you couldn’t understand why their parents are angry. Your vile, cruel, and bigoted behavior should not be excused or ‘swept under the rug’.”", "The other parents who levelled these accusations against the Oklahoma politician, allege that, alongside directing profane language and slander at their children, Ms Broyles also commented on everything from one teen girl’s ethnicity to another’s acne.", "Parents then alleged that Ms Broyles, after launching into these personal and derogatory attacks, threw up in the nearby laundry hamper and on one of the girl’s shoes.", "Ms Broyles says that she chose to write about the intimate and uncomfortable details about her last few weeks as “I should’ve gotten help sooner, and if you’re suffering, please know, there is help”.", "While the thrust of her essay does concede that her bid for Congress is over, the last few lines of her essay hint that she might have other plans for the future.", "“I don’t know what the journey ahead for me looks like, but I’m grateful to be alive with a fighting spirit and keep my promise – I’m not done yet.”"]},
{"url": "https://news.yahoo.com/russian-general-said-ukraine-invasion-162705478.html", "source": "Yahoo News", "title": "Russian general who said Ukraine invasion would be over in hours is reported killed", "description": "A Russian general who boasted that the invasion of Ukraine would be over in hours has been killed, it was reported on Friday.", "date": "2022-03-25T16:27:05.000Z", "author": "Patrick Sawer", "text": ["A Russian general who boasted that the invasion of Ukraine would be over in hours has been killed, ", ".", "Lieutenant General Yakov Rezantsev was killed in a strike on his command post by Ukrainian armed forces, said military sources in Kyiv.", "The 48-year-old is the latest senior Russian commander to die ", ".", "Rezantsev, Commander of the 49th Combined Arms Army of the Southern Military District, is understood to have been killed during a strike on an airfield near the village of Chornobaivka, ", ".", "Oleksiy Arestovych, an adviser to the head of the president's office, said: \"Over the past day, our troops – as we previously reported and we can now say for sure – killed the commander of the 49th Combined Arms Army of the Southern Military District of Russia, Lieutenant General Yakov Vladimirovich Rezantsev.\"", "Rezantsev had reportedly told his men on the fourth day of their deployment that the so-called \"special operation\" would be over quickly. One soldier said: \"Do you know what he told us? 'It's no secret to anyone that there are only a few hours until this special operation is over.' And now those hours are still going.\"", "The general's death means the Russian army has lost 15 military commanders ", ". Military analysts believe this is a higher casualty rate for the country than in any conflict since World War Two.", "Some are understood to have gone to the front line ", " and take personal command of reluctant troops.", "Rezantsev is the fifth general Ukraine claims to have killed since Russia invaded.", "Major-General Oleg Mityaev, 47, the commander of the army's 150th motorised rifle division, died fighting in the besieged city of Mariupol, while Major General Vitaly Gerasimov, 45, was killed outside the eastern city of Kharkiv on March 7.", "Major-General Andrey Kolesnikov, commander of the Guards Tank Kantemirovskaya Division, was killed in fighting on March 11, and Major-General Andrei Sukhovetsky, 47, was killed by a sniper on March 3."]},
{"url": "https://news.yahoo.com/ukraine-captures-one-russias-most-124539212.html", "source": "Yahoo News", "title": "Ukraine captures one of Russia's most advanced electronic warfare systems, which could reveal military secrets, reports say", "description": "The abandoned Russian Krasukha-4 command module will be examined by Western spy agencies and shipped to the US, reports say.", "date": "2022-03-26T12:45:39.000Z", "author": "Alia Shoaib", "text": ["Ukrainian forces have seized part of one of Russia's most advanced electronic warfare systems, which could reveal its military secrets, reports say.", "The Krasukha-4 command module was found abandoned on the outskirts of Kyiv partly damaged but otherwise intact, ", " reported.", "Photos of the unit posted on social media appear to show the container containing the module covered in tree branches, possibly in a hasty camouflage attempt by retreating Russian forces.", " ", "The system is designed to jam low-orbit satellites, drones, and missiles, but it is also believed to be able to track NATO aircraft, The Times said.", "A complete Krasukha-4 is a two-part system consisting of a command post module and an electronic warfare system, mounted separately on two trucks.", "It is believed that a Krasukha-4 system was used against Turkish Bayraktar TB2 drones in Syria, interfering with their control signal and causing them to crash, according to ", ".", "The highly-rated Bayraktar TB2 drones are among those used by Ukrainian forces, used to ", "The seized unit will be examined by Western spy agencies, ", " adding that it would likely be taken by road to the US Air Force's Ramstein Air Base in Germany, before being flown to the US.", "Examining the unit could reveal secrets of how it works, which could help Ukraine and Western allies render it useless on the battlefield.", "Justin Crump, a military veteran and CEO of ", " told The Times that the seizure was among \"lots of goodies that have been recovered on the battlefield.\"", "\"It shows how scattered the fighting is and the lack of communications on the Russian side,\" Crump told the paper.", "Read the original article on "]},
{"url": "https://news.yahoo.com/see-arkansas-razorbacks-cheerleaders-rescue-022903328.html", "source": "Yahoo News", "title": "See Arkansas Razorbacks cheerleaders rescue stuck basketball vs. Duke in Elite 8 game", "description": "A pair of Arkansas Razorbacks cheerleaders rescued a stuck basketball from atop the backboard against Duke in the NCAA Tournament Elite Eight.", "date": "2022-03-27T02:57:00.000Z", "author": "Erik Hall, Fort Smith Times Record", "text": ["A pair of Arkansas Razorbacks cheerleaders rescued a basketball stuck atop the backboard during the second half against Duke in Saturday's NCAA Tournament Elite Eight game.", "With 18:22 left in the second half, Arkansas guard ", " missed a 3-point attempt. After the shot hit the rim, it bounced and got stuck on the top of the backboard.", "Male cheerleader ", " lifted female cheerleader ", " up to knock the ball free.", "\"What a great moment here for the Razorbacks,\" CBS broadcaster ", " said as the ball was knocked free.", "Duke led Arkansas 45-35 at the time.", "No. 4-seeded ", " came into the matchup 28-8 overall. Most recently, ", " 74-68 on Thursday in the NCAA Tournament Sweet 16.", "No. 2 seed Duke entered the contest 31-6 overall. On Thursday, Duke ", " 78-73 in the NCAA Tournament Sweet 16.", "The winner advances to the 2022 NCAA Tournament Final Four in New Orleans that starts Saturday, April 2.", " is the Arkansas Razorbacks men’s basketball head coach. This is his third season as the Arkansas basketball head coach. He previously took Arkansas to the NCAA Tournament in 2020-21. Arkansas ended the 2021 NCAA Tournament with an 81-72 loss to Baylor in the Elite Eight.", "The ", " men’s basketball program made its first appearance in the NCAA Tournament during the 1940-41 season. Arkansas has reached the Final Four on six occasions. Arkansas last reached the Final Four in 1995, when it lost to UCLA in the national championship game. Arkansas won its only ", " in 1993-94.", "The NCAA Tournament national championship game is scheduled to take place Monday, April 4."]},
{"url": "https://news.yahoo.com/russian-crew-aboard-putin-suspected-184511777.html", "source": "Yahoo News", "title": "The Russian crew aboard Putin’s suspected superyacht have abandoned their jobs on the $700 million boat", "description": "The $700 million \"Scheherazade,\" which is linked to Putin, is now under investigation after being abandoned by its Russian crew.", "date": "2022-03-25T18:45:11.000Z", "author": "Amiah Taylor", "text": ["The Russian crew aboard a $700 million yacht named Scheherazade with potential links to President Putin have abandoned their jobs aboard the ship, as first reported by ", "Allegedly, due to ", ", all employees vacated their posts. Following the departure of all the Russian crew members,", ".", "The ship's captain, Guy, who is also British, previously denied to ", " that the Scheherazade was owned by Putin and alleged that the Russian president had never been aboard the ship.", "The ship ", ", but is under scrutiny. Officials will not make further comments until the conclusion of an investigation by the Italian authorities, according to ", ".", "The Scheherazade is currently docked at the Marina di Carrara in Italy, and ", ". Before Russia’s invasion of Ukraine, the ", " was manned by ", " which included", ", since the ", ".", "Some of the ship’s employees were identified as FSO—or Federal Guard Service— personnel, who are tasked with protecting the Russian President, according to a ", " posted by two activists, investigative journalist Maria Pevchikh and the anti-corruption activist Georgy Alburov, on Monday. The yacht itself is enormous, and contains ", ", and other luxury amenities.", "Luxury yachts like the Scheherazade are being seized all over Europe, with countries like ", " impounding the nautical status symbols as a part of sanctions against Russia, following its ", ". France has ", " worth", ", and Germany has also impounded multiple luxury Russian yachts, with one notable seizure being valued at ", ". Italy has also seized Russian yachts valued at over $500 million.", "In Italy, France, and Germany, $1 billion in Russian boats have been taken from sanctioned individuals so far.", "While Putin is being widely criticized as a “", ",” and facing mounting public backlash, he is not alone in facing social and financial consequences.", "The sanctions imposed against Russia are meant not only to hurt the Russian president, but ", " as well. The private jets, mansions, and yachts that are seized by worldwide governments are considered frozen assets but could ultimately lead to financial gains for Ukraine.", "In a bipartisan bill called the “Yachts for Ukraine Act,” the authorities would be permitted to ", " to provide humanitarian support, weapons and refugee assistance to Ukraine.", "This story was originally featured on "]},
{"url": "https://news.yahoo.com/atmospheric-river-bringing-beneficial-rain-002657472.html", "source": "Yahoo News", "title": "Atmospheric river bringing beneficial rain to San Diego", "description": "Research into the moisture-driven storms is growing.", "date": "2022-03-26T00:26:57.000Z", "author": "KGTV - San Diego Scripps", "text": ["Research into the moisture-driven storms is growing."]},
{"url": "https://news.yahoo.com/baffert-trained-country-grammer-wins-173400924.html", "source": "Yahoo News", "title": "Baffert-trained Country Grammer wins Dubai World Cup", "description": "Country Grammer provided Hall of Fame trainer Bob Baffert with victory in the $12 million Dubai World Cup on Saturday.  Ridden by Frankie Dettori, Country...", "date": "2022-03-26T17:34:00.000Z", "author": "Associated Press", "text": ["DUBAI, United Arab Emirates (AP) — Country Grammer provided Hall of Fame trainer Bob Baffert with victory in the $12 million Dubai World Cup on Saturday.", "Ridden by Frankie Dettori, Country Grammer pulled ahead of favorite Life Is Good a half furlong from the finish and won by about two lengths on the 1 1/4-mile (2,000-meter) course at Meydan.", "Hot Rod Charlie was second and Japan's Chuwa Wizard, last year's runner-up, edged Life Is Good for third.", "Life Is Good got off to a fast start and led the field into the home turn but faded as Dettori's well-timed challenge paid off.", "Country Grammer, owned by Los Angeles-born Saudi investor Amr Zedan, was the runner-up at the Saudi Cup in February after a nine-month layoff.", "It's the fourth Dubai World Cup victory for Dettori.", "Baffert was handed a 90-day suspension by Kentucky racing officials for a failed post-race drug test by Medina Spirit that led to his disqualification as last year’s Kentucky Derby winner.", "Baffert’s ", " last week that the suspension should not be imposed until he has had a chance for an appeal hearing with the Kentucky Horse Racing Commission. That hearing is scheduled for April 18.", "___", "More AP sports: https://apnews.com/hub/apf-sports and https://twitter.com/AP_Sports"]},
{"url": "https://news.yahoo.com/huel-monica-one-last-time-223300398.html", "source": "Yahoo News", "title": "Huel and Monica: One last time", "description": "On Friday, March 25, 2022, Huel Perkins and Monica Gayle signed off of FOX 2 news after 25 years together. Congratulations. The best is yet to come.", "date": "2022-03-25T22:33:00.000Z", "author": "WJBK", "text": ["On Friday, March 25, 2022, Huel Perkins and Monica Gayle signed off of FOX 2 news after 25 years together. Congratulations. The best is yet to come."]},
{"url": "https://news.yahoo.com/took-viral-photo-judge-ketanji-201531068.html", "source": "Yahoo News", "title": "I took the viral photo of Judge Ketanji Brown Jackson. Here's what it means to me", "description": "Sarahbeth Maney took the viral photo of Leila Jackson beaming at her mother, Judge Ketanji Brown Jackson, during the Supreme Court hearings.", "date": "2022-03-25T20:15:31.000Z", "author": "Sarahbeth Maney", "text": ["When President Joseph Biden announced he would nominate the first Black woman to be a U.S. Supreme Court Justice, I raised my hand to cover the story. I wanted to provide representation and take photos that show the historic moment from my perspective as a Black woman.", "When I take photos, I try to capture what I feel and not just what I see. I look for the small, intimate moments during the hearings to give readers a sense of what it feels like being in that room. As I was scanning the hearing room, my gaze fell on Judge Jackson’s daughter Leila, and I was touched by how proud she looked while looking at her mom. I felt the admiration that she held for her mother but also the pride she experienced as a young Black woman. Her look also reveals a glimmer of hope for her own future. I understood this and snapped the photo, feeling as if I caught the power of that look.", "I also look for joy in the Black community and try to represent it as much as I can. Historically, we have not seen many ", " or what it feels like to be a proud Black person. That look from Leila to ", " felt so joyful that I wanted others to experience it.", "Being in that room, I understood a little of what Judge Jackson was going through. I know what it takes to make a place for myself in spaces that were not designed for me. These hearings were the first time in my career that I have worked with more than one other Black photographer, which is a big deal for me. I knew I was sharing a room with others who understand my experiences and emotions as we worked long days chronicling this historic event. Our perspectives added cultural nuance to how we were documenting this noteworthy first, and I felt a purpose and power in covering it.", "As a photographer, I have often searched for in-between moments, those small seconds of emotion that are sometimes missed. Starting in fourth grade, I carried my camera with me everywhere. I snapped photographs of daily life in the predominately white area I grew up in as a way to process my experiences. My camera helped me translate my feelings, thoughts and identity through the images I took. Photography has always felt personal to me, and I started at young age by documenting life and being curious to learn about other people. This helps me remember snippets of time some people choose to overlook.", "I had no idea when I took the photo of Leila that so many people would respond so positively to the image and her expression of pride. It wasn’t until a Times reporter told me that everyone on social media was sharing that photo that I even understood how widely it had spread. I ", ", so people knew that I made it, and added the caption: “Being the first often means you have to be the best — and the bravest.”", "But seeing it spread so widely and shared by famous public figures, such as Martin Luther King’s daughter Bernice King, Meena Harris and other public figures, feels like the highest honor. It’s been incredible to experience such positive reactions and I hope it inspired people to be proud of who they are. Although my parents don’t do social media, they have been extremely proud and have shed many tears like I have.", "I hope my images are changing the narrative. I would often watch documentaries and look for pictures of photographers at events; I’d search for a Black female photographer among them — most often to be disappointed that there were none. I want my visibility to show that Black women are fully capable of being photojournalists and achieving highs in their own careers, despite how much we have to fight for representation and respect.", "I also want my picture to inspire other Black girls to turn their own lens onto the world. There are not enough Black women in photojournalism and I hope to forge a path for more to join our industry. When you’re the only one it feels difficult and I’ve experienced that — but I hope it will be different for those who come after me."]},
{"url": "https://news.yahoo.com/mayoral-race-heats-candidate-accuses-090012929.html", "source": "Yahoo News", "title": "Mayoral race heats up after candidate accuses opponent of 'anti-immigrant' views", "description": "City Commissioner David Arreola says his opponent in the mayor's race made \"anti-immigrant\" comments on Facebook.", "date": "2022-03-27T09:00:12.000Z", "author": "John Henderson, The Gainesville Sun", "text": ["Sparks are flying between two Gainesville mayoral candidates who are still months away from public debates.", "The latest feud comes between former Gainesville Regional Utilities General Manager Ed Bielarski, and City Commissioner David Arreola, who is accusing his opponent of making \"anti-immigrant\" comments on Facebook earlier this week.", "The debate boils down to the city's recent decision to move forward with a language access program, which, if approved, could bridge the language barrier between non-English speaking residents and local government. The estimated annual cost is about $316,000.", "Bielarski questions whether the program is too much for the number of people it would serve, adding that the commission's recent decision to scratch a less-costly, call-in service for public comments at meetings that could serve more residents during the pandemic was short-sighted.", "\"Ninety percent or more of the population who speaks English is also concerned about going down to a City Hall chambers and being exposed to COVID,” He said. “And most of those are elderly. Most of those are people who have these other (health) conditions. You are discriminating against them in favor of others, and I don’t think that is the business we ought to be in.”", "On March 17, the commission voted to move forward with the Gainesville Immigrant Neighbor Inclusion (GINI) Initiative recommendation of a ", ". The city plans to start with Spanish, then may move on to Chinese Mandarin, Vietnamese, Portuguese and Haitian Creole.", "The program would offer a call-in translation line, translation of most city documents, bilingual signs, translation of Gainesville Regional Utilities applications and payment options and translation for the city’s website, social media and media releases.", "At the same meeting, ", " that the city started up during the pandemic so people could call in for comments, instead of attending in person. The city was on pace to spend more than $130,000 annually on the service that was often used by meeting regulars at a cost of more than $110 a call.", "While engaging with online commenters on Facebook, Bielarski wrote \"If I were to prioritize, I would retain the call-in program and stop the multi-lingual program.\"", "Bielarski says the issue is about priorities, nothing more, and that new programs should be discussed for during the budget cycle.", "“This is about having a discussion,\" he said. \"All these things ought to be on the table. We ought to be able to voice our opinion.\"", "His former boss, Arreola, sees it differently.", "“I’m a first generation American, born and raised in Gainesville,\" Arreola wrote on Facebook. \"I know what it’s like to see your immigrant parents learn English as a second language to work, live and play in America.", "\"It's sad to see someone running for Mayor of Gainesville sending such an anti-immigrant message.\"", "Arreola doubled down on his position Friday, saying that Bielarski was “pandering to the anti-immigrant sentiment.” He believes the GINI service will allow more residents to be better involved with city resources.", "City Commissioner Harvey Ward, who is also running for mayor, says the issues are two completely separate issues.", "“The call-in service was poorly used and was extremely valuable in the depth of the pandemic when there was no other way for the people to be involved in the public process,\" he said. \"Since then, we have had just a handful of folks calling in, and those folks are the same people who have been regulars for years.\"", "Ward voted to end the call-in service and supported the translation service.", "“We absolutely should make sure that the people who live here or are even visiting here have access to public safety and utility hookups and all of the other things that Gainesville offers,” he said.", "With qualifying still months away, five people have filed to run for mayor, as Lauren Poe's term comes to an end.", "Ward leads the pack, having raised $14,345 in the month of February, while Arreola follows closely behind with $11,150. Arreola raised about $1,000 in Febrary. Bielarski ranks third currently with $10,358, almost of which was also in February.", "July Thomas, who filed on Feb. 28, has raised $480. Donald Shepherd, who has unsuccessfully run for mayor multiple times, has raised $0.", "In other city races, candidates are lining up for the election.", "In District 3, candidate Ed Book has raised significantly more than his opponents with $8,025. Michael Rayburn has received $120, Patrick Ingle has $47 and Jo Beatty $0. District 2's only candidate James Ingle has also raised $0.", "District 4's Bryan Eastman has $8,845 in donations. His opponent, Christian Newman, has accumulated $11,545 so far."]},
{"url": "https://news.yahoo.com/ed-department-official-grades-scores-160100390.html", "source": "Yahoo News", "title": "Ed Department Official: Grades Are Up, Scores Are Down. Education ‘Runs on Lies’", "description": "Mark Schneider is the commissioner of the U.S. Department of Education’s Institute for Education Services. He published the below remarks March 23 at...", "date": "2022-03-26T16:01:00.000Z", "author": "Mark Schneider", "text": ["Mark Schneider is the commissioner of the U.S. Department of Education’s Institute for Education Services. He published the below remarks ", ":", "The title of this blog is taken from the opening of Arne Duncan’s 2018 book ", ". This was not a new theme for Duncan. In ", ", he said: “As a country we’ve dummied down standards. We’ve reduced them due to political pressure and, we’ve actually been lying to children and parents telling them they’re ready when they’re not . . . ” As a reminder, Duncan was Secretary of Education under President Obama from 2009 through 2015—not a “usual suspect” for such a damning criticism of America’s schools.", "On Wednesday, March 16, the latest results from the recent High School Transcript Study were released. Unfortunately, they support Secretary Duncan’s charge that schools routinely mislead their students. (Read Linda Jacobson’s summary of ", ")", "The NAEP High School Transcript Study periodically gathers detailed information about the courses that American high school students take, including information on the number of academic courses taken, the level of those courses (for example, algebra, pre-calculus, calculus), and the grades students are awarded. But perhaps the most important contribution of NAEP to the study of transcripts is that it also administers high quality assessments of what students know and can do in a variety of fields, including science and math.", "There are many data points in the just-released high school transcript study that, if they were true reflections of reality, should lead us all to celebrate the success of our students. Here are a few:", " At the time of the last transcript study in 2009, high school graduates had, on average, accumulated 27.2 ", ". This increased to 28.1 in the current study. Most of this gain was attributable to an increase in academic courses.", " The average GPA was 3.11 in 2019—up from 3.00 in 2009.", "— ", " NAEP uses a classificatory scheme to rate the overall rigor of the curriculum a student takes into four levels—below standard, standard, midlevel, and rigorous—depending on the number of Carnegie units a student has earned across English, mathematics, science, social studies, and world languages. The percentage of students who completed a standard or midlevel curriculum in 2019 increased by 4 percentage points compared to 2009. In contrast, the percent of students who completed a below standard curriculum dropped from 23 percent in 2009 to 16 percent in 2019.", "More courses, more rigor, more A grades. All good!", "But here’s where Duncan’s warning about lies comes to mind: despite all this seeming progress, here’s the far grimmer bottom line regarding student performance.", "— Student assessment scores are not increasing. Compared with 2009, the 2019 NAEP science scores have not changed and the 2019 NAEP mathematics scores actually declined for high school graduates.", "— Math scores declined for graduates who completed a midlevel or rigorous curriculum.", "— Science scores are unchanged across curriculum levels.", "— Students completing the most common midlevel curriculum scored in the ", " range in both mathematics and science in 2019.", "— Students with a 4.0 GPA in advanced science have an average score barely within the ", " range.", "The evidence from the most recent transcript study shows a disconnect between what courses high school graduates took (seemingly more and more rigorous ones) and their performance on NAEP science and math assessments.", "We see “inflation” in course grades and course titles but stagnation in student performance. NCES has not conducted a recent, more detailed study on the delivered curriculum—but ", " helps to explain the disconnect. That study explored the actual content and level of challenge of high school algebra I and geometry courses in public schools across the nation. Among the many findings showing that the delivered curriculum is often a far cry from the rigorous-sounding titles that appear in course catalogs is the fact that only 18 percent of honors algebra I courses and 33 percent of honors geometry courses used a rigorous curriculum. In short, many students, even when told they were taking a rigorous and academic-oriented curriculum, were not being given the tools to be fully successful in algebra or geometry.", "We need more students learning demanding math and science skills. Without that foundation, we will never have a large, diverse, and strong STEM workforce—a precondition for the U.S. economy to prosper. Simply telling students who have not truly mastered STEM skills that they are “A students” who have finished a rigorous math and science curriculum is not the way to produce that workforce.", "If education runs on lies, this is one of the more pernicious lies around.", "As always, feel free to contact me: mark.schneider@ed.gov"]},
{"url": "https://news.yahoo.com/russia-says-first-phase-ukraine-134534902.html", "source": "Yahoo News", "title": "Russia says first phase of Ukraine operation mostly complete, focus now on Donbass", "description": "Russia's defence ministry said on Friday that the first phase of its military operation in Ukraine was mostly complete and that it would focus on completely ...", "date": "2022-03-25T13:45:34.000Z", "author": "Reuters", "text": ["LONDON, March 25 (Reuters) - Russia's defence ministry said on Friday that the first phase of its military operation in Ukraine was mostly complete and that it would focus on completely \"liberating\" eastern Ukraine's Donbass region.", "The announcement appeared to indicate that Russia may be switching to more limited goals after running into fierce Ukrainian resistance in the first month of the war", "Russian news agencies quoted the defence ministry as saying that Russian-backed separatists now controlled 93% of Ukraine's Luhansk region and 54% of the Donetsk region - the two areas that jointly make up the Donbass.", "The ministry said it did not rule out storming Ukrainian cities that had been blockaded and that Russia would react immediately to any attempt to close the airspace over Ukraine - something Kyiv has asked NATO to do, but NATO has resisted.", "Russia sent tens of thousands of troops into Ukraine on Feb. 24 in what it called a \"special operation\" to weaken its southern neighbour's military capabilities and root out people it called dangerous nationalists.", "Ukrainian forces have mounted stiff resistance to the invasion and the West has imposed sweeping sanctions on Russia in an effort to force it to withdraw its forces.", "The defence ministry said on Friday that the operation would continue until Russian forces had completed the tasks that had been set, without elaborating.", "Russia's military had considered two options for its operation in Ukraine, one confined to the Donbass and the other on the whole territory of Ukraine, the defence ministry continued. (Reporting by Reuters, Editing by Mark Trevelyan)"]}
]